# LayerModifier Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
LayerModifier Constructor
LayerModifier Class See Also
---
Constructs a new LayerModifier with default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public LayerModifier()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
LayerModifier()
```

# See Also
LayerModifier Class
LayerModifier Overload
Autodesk.Revit.DB Namespace